IDEA Open Model
RigidLink.RigidRX Property
Compatible with IDEA StatiCa 20.1
 DOF rigid in RX dirrection
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public bool RigidRX { get; set; }
Public Property RigidRX As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
RigidLink Class
IdeaRS.OpenModel.Model Namespace